<!-- add-pr-comment:common_plan -->

# production/common Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_athena_database.notification_quicksight will be destroyed
  # (because aws_athena_database.notification_quicksight is not in configuration)
  - resource "aws_athena_database" "notification_quicksight" {
      - bucket        = "notification-canada-ca-production-athena" -> null
      - force_destroy = false -> null
      - id            = "notification_quicksight" -> null
      - name          = "notification_quicksight" -> null
      - properties    = {} -> null
      - region        = "ca-central-1" -> null
        # (1 unchanged attribute hidden)
      - encryption_configuration {
          - encryption_option = "SSE_S3" -> null
            # (1 unchanged attribute hidden)
        }
    }
  # aws_athena_workgroup.notification_quicksight will be destroyed
  # (because aws_athena_workgroup.notification_quicksight is not in configuration)
  - resource "aws_athena_workgroup" "notification_quicksight" {
      - arn           = "arn:aws:athena:ca-central-1:296255494825:workgroup/Notification_quicksight" -> null
      - force_destroy = false -> null
      - id            = "Notification_quicksight" -> null
      - name          = "Notification_quicksight" -> null
      - region        = "ca-central-1" -> null
      - state         = "ENABLED" -> null
      - tags          = {
          - "CostCenter" = "notification-canada-ca-production"
        } -> null
      - tags_all      = {
          - "CostCenter" = "notification-canada-ca-production"
        } -> null
        # (1 unchanged attribute hidden)
      - configuration {
          - bytes_scanned_cutoff_per_query     = 0 -> null
          - enforce_workgroup_configuration    = true -> null
          - publish_cloudwatch_metrics_enabled = true -> null
          - requester_pays_enabled             = false -> null
            # (1 unchanged attribute hidden)
          - engine_version {
              - effective_engine_version = "Athena engine version 3" -> null
              - selected_engine_version  = "AUTO" -> null
            }
          - result_configuration {
              - output_location       = "s3://notification-canada-ca-production-athena" -> null
                # (1 unchanged attribute hidden)
              - encryption_configuration {
                  - encryption_option = "SSE_S3" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }
    }
  # aws_glue_catalog_table.notification_history will be destroyed
  # (because aws_glue_catalog_table.notification_history is not in configuration)
  - resource "aws_glue_catalog_table" "notification_history" {
      - arn                = "arn:aws:glue:ca-central-1:296255494825:table/notification_quicksight/notification_history" -> null
      - catalog_id         = "296255494825" -> null
      - database_name      = "notification_quicksight" -> null
      - id                 = "296255494825:notification_quicksight:notification_history" -> null
      - name               = "notification_history" -> null
      - parameters         = {
          - "EXTERNAL" = "TRUE"
        } -> null
      - region             = "ca-central-1" -> null
      - retention          = 0 -> null
      - table_type         = "EXTERNAL_TABLE" -> null
        # (4 unchanged attributes hidden)
      - storage_descriptor {
          - additional_locations      = [] -> null
          - bucket_columns            = [] -> null
          - compressed                = false -> null
          - input_format              = "org.apache.hadoop.hive.ql.io.parquet.MapredParquetInputFormat" -> null
          - location                  = "s3://bucket_placeholder/table/" -> null
          - number_of_buckets         = 0 -> null
          - output_format             = "org.apache.hadoop.hive.ql.io.parquet.MapredParquetOutputFormat" -> null
          - parameters                = {} -> null
          - stored_as_sub_directories = false -> null
          - columns {
              - name       = "id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "job_id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "job_row_number" -> null
              - parameters = {} -> null
              - type       = "int" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "service_id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "template_id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "template_version" -> null
              - parameters = {} -> null
              - type       = "int" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "api_key_id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "key_type" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "notification_type" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "created_at" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "sent_at" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "sent_by" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "updated_at" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "reference" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "billable_units" -> null
              - parameters = {} -> null
              - type       = "int" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "client_reference" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "international" -> null
              - parameters = {} -> null
              - type       = "boolean" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "phone_prefix" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "rate_multiplier" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "notification_status" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "created_by_id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "postage" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "queue_name" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "feedback_type" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "feedback_subtype" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "ses_feedback_id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "ses_feedback_date" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "sms_total_message_price" -> null
              - parameters = {} -> null
              - type       = "double" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "sms_total_carrier_fee" -> null
              - parameters = {} -> null
              - type       = "double" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "sms_iso_country_code" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "sms_carrier_name" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "sms_message_encoding" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "sms_origination_phone_number" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "feedback_reason" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - ser_de_info {
                name                  = null
              - parameters            = {} -> null
              - serialization_library = "org.apache.hadoop.hive.ql.io.parquet.serde.ParquetHiveSerDe" -> null
            }
        }
    }
  # aws_glue_catalog_table.notifications will be destroyed
  # (because aws_glue_catalog_table.notifications is not in configuration)
  - resource "aws_glue_catalog_table" "notifications" {
      - arn                = "arn:aws:glue:ca-central-1:296255494825:table/notification_quicksight/notifications" -> null
      - catalog_id         = "296255494825" -> null
      - database_name      = "notification_quicksight" -> null
      - id                 = "296255494825:notification_quicksight:notifications" -> null
      - name               = "notifications" -> null
      - parameters         = {
          - "EXTERNAL" = "TRUE"
        } -> null
      - region             = "ca-central-1" -> null
      - retention          = 0 -> null
      - table_type         = "EXTERNAL_TABLE" -> null
        # (4 unchanged attributes hidden)
      - storage_descriptor {
          - additional_locations      = [] -> null
          - bucket_columns            = [] -> null
          - compressed                = false -> null
          - input_format              = "org.apache.hadoop.hive.ql.io.parquet.MapredParquetInputFormat" -> null
          - location                  = "s3://bucket_placeholder/table/" -> null
          - number_of_buckets         = 0 -> null
          - output_format             = "org.apache.hadoop.hive.ql.io.parquet.MapredParquetOutputFormat" -> null
          - parameters                = {} -> null
          - stored_as_sub_directories = false -> null
          - columns {
              - name       = "id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "to" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "job_id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "service_id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "template_id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "created_at" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "sent_at" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "sent_by" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "updated_at" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "reference" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "template_version" -> null
              - parameters = {} -> null
              - type       = "int" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "job_row_number" -> null
              - parameters = {} -> null
              - type       = "int" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "_personalisation" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "api_key_id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "key_type" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "notification_type" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "billable_units" -> null
              - parameters = {} -> null
              - type       = "int" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "client_reference" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "international" -> null
              - parameters = {} -> null
              - type       = "boolean" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "phone_prefix" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "rate_multiplier" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "notification_status" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "normalised_to" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "created_by_id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "reply_to_text" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "postage" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "provider_response" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "queue_name" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "feedback_type" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "feedback_subtype" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "ses_feedback_id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "ses_feedback_date" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "sms_total_message_price" -> null
              - parameters = {} -> null
              - type       = "double" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "sms_total_carrier_fee" -> null
              - parameters = {} -> null
              - type       = "double" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "sms_iso_country_code" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "sms_carrier_name" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "sms_message_encoding" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "sms_origination_phone_number" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "feedback_reason" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - ser_de_info {
                name                  = null
              - parameters            = {} -> null
              - serialization_library = "org.apache.hadoop.hive.ql.io.parquet.serde.ParquetHiveSerDe" -> null
            }
        }
    }
  # aws_glue_catalog_table.organisation will be destroyed
  # (because aws_glue_catalog_table.organisation is not in configuration)
  - resource "aws_glue_catalog_table" "organisation" {
      - arn                = "arn:aws:glue:ca-central-1:296255494825:table/notification_quicksight/organisation" -> null
      - catalog_id         = "296255494825" -> null
      - database_name      = "notification_quicksight" -> null
      - id                 = "296255494825:notification_quicksight:organisation" -> null
      - name               = "organisation" -> null
      - parameters         = {
          - "EXTERNAL" = "TRUE"
        } -> null
      - region             = "ca-central-1" -> null
      - retention          = 0 -> null
      - table_type         = "EXTERNAL_TABLE" -> null
        # (4 unchanged attributes hidden)
      - storage_descriptor {
          - additional_locations      = [] -> null
          - bucket_columns            = [] -> null
          - compressed                = false -> null
          - input_format              = "org.apache.hadoop.hive.ql.io.parquet.MapredParquetInputFormat" -> null
          - location                  = "s3://bucket_placeholder/table/" -> null
          - number_of_buckets         = 0 -> null
          - output_format             = "org.apache.hadoop.hive.ql.io.parquet.MapredParquetOutputFormat" -> null
          - parameters                = {} -> null
          - stored_as_sub_directories = false -> null
          - columns {
              - name       = "id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "name" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "active" -> null
              - parameters = {} -> null
              - type       = "boolean" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "created_at" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "updated_at" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "email_branding_id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "letter_branding_id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "agreement_signed" -> null
              - parameters = {} -> null
              - type       = "boolean" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "agreement_signed_at" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "agreement_signed_by_id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "agreement_signed_version" -> null
              - parameters = {} -> null
              - type       = "double" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "crown" -> null
              - parameters = {} -> null
              - type       = "boolean" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "organisation_type" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "request_to_go_live_notes" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "agreement_signed_on_behalf_of_email_address" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "agreement_signed_on_behalf_of_name" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "default_branding_is_french" -> null
              - parameters = {} -> null
              - type       = "boolean" -> null
                # (1 unchanged attribute hidden)
            }
          - ser_de_info {
                name                  = null
              - parameters            = {} -> null
              - serialization_library = "org.apache.hadoop.hive.ql.io.parquet.serde.ParquetHiveSerDe" -> null
            }
        }
    }
  # aws_glue_catalog_table.services will be destroyed
  # (because aws_glue_catalog_table.services is not in configuration)
  - resource "aws_glue_catalog_table" "services" {
      - arn                = "arn:aws:glue:ca-central-1:296255494825:table/notification_quicksight/services" -> null
      - catalog_id         = "296255494825" -> null
      - database_name      = "notification_quicksight" -> null
      - id                 = "296255494825:notification_quicksight:services" -> null
      - name               = "services" -> null
      - parameters         = {
          - "EXTERNAL" = "TRUE"
        } -> null
      - region             = "ca-central-1" -> null
      - retention          = 0 -> null
      - table_type         = "EXTERNAL_TABLE" -> null
        # (4 unchanged attributes hidden)
      - storage_descriptor {
          - additional_locations      = [] -> null
          - bucket_columns            = [] -> null
          - compressed                = false -> null
          - input_format              = "org.apache.hadoop.hive.ql.io.parquet.MapredParquetInputFormat" -> null
          - location                  = "s3://bucket_placeholder/table/" -> null
          - number_of_buckets         = 0 -> null
          - output_format             = "org.apache.hadoop.hive.ql.io.parquet.MapredParquetOutputFormat" -> null
          - parameters                = {} -> null
          - stored_as_sub_directories = false -> null
          - columns {
              - name       = "id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "name" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "created_at" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "updated_at" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "active" -> null
              - parameters = {} -> null
              - type       = "boolean" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "message_limit" -> null
              - parameters = {} -> null
              - type       = "bigint" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "restricted" -> null
              - parameters = {} -> null
              - type       = "boolean" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "email_from" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "created_by_id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "version" -> null
              - parameters = {} -> null
              - type       = "int" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "research_mode" -> null
              - parameters = {} -> null
              - type       = "boolean" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "organisation_type" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "prefix_sms" -> null
              - parameters = {} -> null
              - type       = "boolean" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "crown" -> null
              - parameters = {} -> null
              - type       = "boolean" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "rate_limit" -> null
              - parameters = {} -> null
              - type       = "int" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "contact_link" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "consent_to_research" -> null
              - parameters = {} -> null
              - type       = "boolean" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "volume_email" -> null
              - parameters = {} -> null
              - type       = "int" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "volume_letter" -> null
              - parameters = {} -> null
              - type       = "int" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "volume_sms" -> null
              - parameters = {} -> null
              - type       = "int" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "count_as_live" -> null
              - parameters = {} -> null
              - type       = "boolean" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "go_live_at" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "go_live_user_id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "organisation_id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "sending_domain" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "default_branding_is_french" -> null
              - parameters = {} -> null
              - type       = "boolean" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "sms_daily_limit" -> null
              - parameters = {} -> null
              - type       = "bigint" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "organisation_notes" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "sensitive_service" -> null
              - parameters = {} -> null
              - type       = "boolean" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "email_annual_limit" -> null
              - parameters = {} -> null
              - type       = "bigint" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "sms_annual_limit" -> null
              - parameters = {} -> null
              - type       = "bigint" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "suspended_by_id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "suspended_at" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - ser_de_info {
                name                  = null
              - parameters            = {} -> null
              - serialization_library = "org.apache.hadoop.hive.ql.io.parquet.serde.ParquetHiveSerDe" -> null
            }
        }
    }
  # aws_glue_catalog_table.template_categories will be destroyed
  # (because aws_glue_catalog_table.template_categories is not in configuration)
  - resource "aws_glue_catalog_table" "template_categories" {
      - arn                = "arn:aws:glue:ca-central-1:296255494825:table/notification_quicksight/template_categories" -> null
      - catalog_id         = "296255494825" -> null
      - database_name      = "notification_quicksight" -> null
      - id                 = "296255494825:notification_quicksight:template_categories" -> null
      - name               = "template_categories" -> null
      - parameters         = {
          - "EXTERNAL" = "TRUE"
        } -> null
      - region             = "ca-central-1" -> null
      - retention          = 0 -> null
      - table_type         = "EXTERNAL_TABLE" -> null
        # (4 unchanged attributes hidden)
      - storage_descriptor {
          - additional_locations      = [] -> null
          - bucket_columns            = [] -> null
          - compressed                = false -> null
          - input_format              = "org.apache.hadoop.hive.ql.io.parquet.MapredParquetInputFormat" -> null
          - location                  = "s3://bucket_placeholder/table/" -> null
          - number_of_buckets         = 0 -> null
          - output_format             = "org.apache.hadoop.hive.ql.io.parquet.MapredParquetOutputFormat" -> null
          - parameters                = {} -> null
          - stored_as_sub_directories = false -> null
          - columns {
              - name       = "id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "name_en" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "name_fr" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "description_en" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "description_fr" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "sms_process_type" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "email_process_type" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "hidden" -> null
              - parameters = {} -> null
              - type       = "boolean" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "created_at" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "updated_at" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "sms_sending_vehicle" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "created_by_id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "updated_by_id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - ser_de_info {
                name                  = null
              - parameters            = {} -> null
              - serialization_library = "org.apache.hadoop.hive.ql.io.parquet.serde.ParquetHiveSerDe" -> null
            }
        }
    }
  # aws_glue_catalog_table.templates will be destroyed
  # (because aws_glue_catalog_table.templates is not in configuration)
  - resource "aws_glue_catalog_table" "templates" {
      - arn                = "arn:aws:glue:ca-central-1:296255494825:table/notification_quicksight/templates" -> null
      - catalog_id         = "296255494825" -> null
      - database_name      = "notification_quicksight" -> null
      - id                 = "296255494825:notification_quicksight:templates" -> null
      - name               = "templates" -> null
      - parameters         = {
          - "EXTERNAL" = "TRUE"
        } -> null
      - region             = "ca-central-1" -> null
      - retention          = 0 -> null
      - table_type         = "EXTERNAL_TABLE" -> null
        # (4 unchanged attributes hidden)
      - storage_descriptor {
          - additional_locations      = [] -> null
          - bucket_columns            = [] -> null
          - compressed                = false -> null
          - input_format              = "org.apache.hadoop.hive.ql.io.parquet.MapredParquetInputFormat" -> null
          - location                  = "s3://bucket_placeholder/table/" -> null
          - number_of_buckets         = 0 -> null
          - output_format             = "org.apache.hadoop.hive.ql.io.parquet.MapredParquetOutputFormat" -> null
          - parameters                = {} -> null
          - stored_as_sub_directories = false -> null
          - columns {
              - name       = "id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "name" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "template_type" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "created_at" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "updated_at" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "content" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "service_id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "subject" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "created_by_id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "version" -> null
              - parameters = {} -> null
              - type       = "int" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "archived" -> null
              - parameters = {} -> null
              - type       = "boolean" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "process_type" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "service_letter_contact_id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "hidden" -> null
              - parameters = {} -> null
              - type       = "boolean" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "postage" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "template_category_id" -> null
              - parameters = {} -> null
              - type       = "string" -> null
                # (1 unchanged attribute hidden)
            }
          - columns {
              - name       = "text_direction_rtl" -> null
              - parameters = {} -> null
              - type       = "boolean" -> null
                # (1 unchanged attribute hidden)
            }
          - ser_de_info {
                name                  = null
              - parameters            = {} -> null
              - serialization_library = "org.apache.hadoop.hive.ql.io.parquet.serde.ParquetHiveSerDe" -> null
            }
        }
    }
  # aws_wafv2_regex_pattern_set.re_admin2 will be updated in-place
  ~ resource "aws_wafv2_regex_pattern_set" "re_admin2" {
        id          = "d2814ed4-6817-4fc1-9e7a-0b39ca8803cc"
        name        = "re_admin2"
        tags        = {
            "CostCenter" = "notification-canada-ca-production"
        }
        # (7 unchanged attributes hidden)
      - regular_expression {
          - regex_string = "/by-and-for-gc|/par-et-pour-gc|/newsletter-subscription|/known-issues|/problemes-connus|/accessibility-202512|/accessibilite-202512" -> null
        }
      + regular_expression {
          + regex_string = "/by-and-for-gc|/par-et-pour-gc"
        }
        # (1 unchanged block hidden)
    }
  # aws_wafv2_regex_pattern_set.re_api will be updated in-place
  ~ resource "aws_wafv2_regex_pattern_set" "re_api" {
        id          = "3fea9ebe-59ba-494c-9e15-f15d85dbc4a7"
        name        = "re_api"
        tags        = {
            "CostCenter" = "notification-canada-ca-production"
        }
        # (7 unchanged attributes hidden)
      - regular_expression {
          - regex_string = "/notifications.*|/organisation.*|/organisations.*|/platform-stats.*|/provider-details.*|/service.*|/static.*|/user.*|/v2.*|/cache-clear|/support/find-ids|/newsletter.*" -> null
        }
      + regular_expression {
          + regex_string = "/notifications.*|/organisation.*|/organisations.*|/platform-stats.*|/provider-details.*|/service.*|/static.*|/user.*|/v2.*|/cache-clear|/support/find-ids"
        }
        # (1 unchanged block hidden)
    }
  # module.s3_scan_objects.data.aws_iam_policy_document.limit_tagging[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "limit_tagging" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)
      + statement {
          + actions   = [
              + "s3:DeleteObjectTagging",
              + "s3:DeleteObjectVersionTagging",
              + "s3:PutObjectTagging",
              + "s3:PutObjectVersionTagging",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::notification-canada-ca-production-document-download-scan-files/*",
            ]
          + condition {
              + test     = "StringNotLike"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:PrincipalArn"
            }
          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:PutObjectTagging",
              + "s3:PutObjectVersionTagging",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::notification-canada-ca-production-document-download-scan-files/*",
            ]
          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }
  # module.s3_scan_objects.data.aws_iam_policy_document.s3_scan_object will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_scan_object" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)
      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "S3sendToSQS"
          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + "arn:aws:s3:::notification-canada-ca-production-document-download-scan-files",
                ]
              + variable = "aws:SourceArn"
            }
          + principals {
              + identifiers = [
                  + "s3.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "LambdaTriggerFromSQS"
          + principals {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }
        }
    }
  # module.s3_scan_objects.data.aws_iam_policy_document.scan_files_download[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "scan_files_download" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)
      + statement {
          + actions   = [
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:GetObjectTagging",
              + "s3:GetObjectVersion",
              + "s3:GetObjectVersionTagging",
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::notification-canada-ca-production-document-download-scan-files",
              + "arn:aws:s3:::notification-canada-ca-production-document-download-scan-files/*",
            ]
          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }
  # module.s3_scan_objects.data.aws_iam_policy_document.upload_bucket[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "upload_bucket" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + (known after apply),
          + (known after apply),
        ]
    }
  # module.s3_scan_objects.aws_iam_policy.scan_files[0] will be created
  + resource "aws_iam_policy" "scan_files" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "ScanFilesGetObjects"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObjectVersionTagging",
                          + "s3:PutObjectTagging",
                          + "s3:ListBucket",
                          + "s3:GetObjectVersionTagging",
                          + "s3:GetObjectVersion",
                          + "s3:GetObjectTagging",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                          + "s3:DeleteObjectVersionTagging",
                          + "s3:DeleteObjectTagging",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::notification-canada-ca-production-document-download-scan-files/*",
                          + "arn:aws:s3:::notification-canada-ca-production-document-download-scan-files",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
    }
  # module.s3_scan_objects.aws_iam_role.scan_files[0] will be created
  + resource "aws_iam_role" "scan_files" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::806545929748:role/s3-scan-object",
                              + "arn:aws:iam::806545929748:role/scan-files-api",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ScanFilesGetObjects"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
      + inline_policy (known after apply)
    }
  # module.s3_scan_objects.aws_iam_role_policy_attachment.scan_files[0] will be created
  + resource "aws_iam_role_policy_attachment" "scan_files" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ScanFilesGetObjects"
    }
  # module.s3_scan_objects.aws_kms_alias.s3_scan_object_queue will be created
  + resource "aws_kms_alias" "s3_scan_object_queue" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/s3_scan_object_queue"
      + name_prefix    = (known after apply)
      + region         = "ca-central-1"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }
  # module.s3_scan_objects.aws_kms_key.s3_scan_object_queue will be created
  + resource "aws_kms_key" "s3_scan_object_queue" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "S3 scan objects KMS key for SQS queue encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::296255494825:root"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS     = "arn:aws:iam::806545929748:role/s3-scan-object"
                          + Service = "s3.amazonaws.com"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region                             = "ca-central-1"
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
    }
  # module.s3_scan_objects.aws_s3_bucket_notification.s3_scan_object will be created
  + resource "aws_s3_bucket_notification" "s3_scan_object" {
      + bucket      = "notification-canada-ca-production-document-download-scan-files"
      + eventbridge = false
      + id          = (known after apply)
      + region      = "ca-central-1"
      + queue {
          + events    = [
              + "s3:ObjectCreated:*",
            ]
          + id        = "ScanObjectCreated"
          + queue_arn = (known after apply)
        }
    }
  # module.s3_scan_objects.aws_s3_bucket_policy.upload_bucket[0] will be created
  + resource "aws_s3_bucket_policy" "upload_bucket" {
      + bucket = "notification-canada-ca-production-document-download-scan-files"
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "ca-central-1"
    }
  # module.s3_scan_objects.aws_sqs_queue.s3_scan_object will be created
  + resource "aws_sqs_queue" "s3_scan_object" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "s3-scan-object"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + region                            = "ca-central-1"
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all                          = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 300
    }
  # module.s3_scan_objects.aws_sqs_queue_policy.s3_scan_object will be created
  + resource "aws_sqs_queue_policy" "s3_scan_object" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
      + region    = "ca-central-1"
    }
  # module.s3_scan_objects[0].aws_iam_policy.scan_files[0] will be destroyed
  # (because module.s3_scan_objects[0] is not in configuration)
  - resource "aws_iam_policy" "scan_files" {
      - arn              = "arn:aws:iam::296255494825:policy/ScanFilesGetObjects" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::296255494825:policy/ScanFilesGetObjects" -> null
      - name             = "ScanFilesGetObjects" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObjectVersionTagging",
                          - "s3:PutObjectTagging",
                          - "s3:ListBucket",
                          - "s3:GetObjectVersionTagging",
                          - "s3:GetObjectVersion",
                          - "s3:GetObjectTagging",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:DeleteObjectVersionTagging",
                          - "s3:DeleteObjectTagging",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::notification-canada-ca-production-document-download-scan-files/*",
                          - "arn:aws:s3:::notification-canada-ca-production-document-download-scan-files",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAUJ6RUDKUUCMXOSAUX" -> null
      - tags             = {
          - "CostCentre" = "notification-canada-ca-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all         = {
          - "CostCentre" = "notification-canada-ca-production"
          - "Terraform"  = "true"
        } -> null
        # (2 unchanged attributes hidden)
    }
  # module.s3_scan_objects[0].aws_iam_role.scan_files[0] will be destroyed
  # (because module.s3_scan_objects[0] is not in configuration)
  - resource "aws_iam_role" "scan_files" {
      - arn                   = "arn:aws:iam::296255494825:role/ScanFilesGetObjects" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = [
                              - "arn:aws:iam::806545929748:role/s3-scan-object",
                              - "arn:aws:iam::806545929748:role/scan-files-api",
                            ]
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-02-08T14:31:21Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ScanFilesGetObjects" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::296255494825:policy/ScanFilesGetObjects",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ScanFilesGetObjects" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "CostCentre" = "notification-canada-ca-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all              = {
          - "CostCentre" = "notification-canada-ca-production"
          - "Terraform"  = "true"
        } -> null
      - unique_id             = "AROAUJ6RUDKUVDI4U36AP" -> null
        # (3 unchanged attributes hidden)
      - inline_policy {
            name   = null
            # (1 unchanged attribute hidden)
        }
    }
  # module.s3_scan_objects[0].aws_iam_role_policy_attachment.scan_files[0] will be destroyed
  # (because module.s3_scan_objects[0] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "scan_files" {
      - id         = "ScanFilesGetObjects-20230208143122310200000001" -> null
      - policy_arn = "arn:aws:iam::296255494825:policy/ScanFilesGetObjects" -> null
      - role       = "ScanFilesGetObjects" -> null
    }
  # module.s3_scan_objects[0].aws_kms_alias.s3_scan_object_queue will be destroyed
  # (because module.s3_scan_objects[0] is not in configuration)
  - resource "aws_kms_alias" "s3_scan_object_queue" {
      - arn            = "arn:aws:kms:ca-central-1:296255494825:alias/s3_scan_object_queue" -> null
      - id             = "alias/s3_scan_object_queue" -> null
      - name           = "alias/s3_scan_object_queue" -> null
      - region         = "ca-central-1" -> null
      - target_key_arn = "arn:aws:kms:ca-central-1:296255494825:key/d456c5ca-c71d-4e66-b95c-75b78fb868b8" -> null
      - target_key_id  = "d456c5ca-c71d-4e66-b95c-75b78fb868b8" -> null
        # (1 unchanged attribute hidden)
    }
  # module.s3_scan_objects[0].aws_kms_key.s3_scan_object_queue will be destroyed
  # (because module.s3_scan_objects[0] is not in configuration)
  - resource "aws_kms_key" "s3_scan_object_queue" {
      - arn                                = "arn:aws:kms:ca-central-1:296255494825:key/d456c5ca-c71d-4e66-b95c-75b78fb868b8" -> null
      - bypass_policy_lockout_safety_check = false -> null
      - customer_master_key_spec           = "SYMMETRIC_DEFAULT" -> null
      - description                        = "S3 scan objects KMS key for SQS queue encryption" -> null
      - enable_key_rotation                = true -> null
      - id                                 = "d456c5ca-c71d-4e66-b95c-75b78fb868b8" -> null
      - is_enabled                         = true -> null
      - key_id                             = "d456c5ca-c71d-4e66-b95c-75b78fb868b8" -> null
      - key_usage                          = "ENCRYPT_DECRYPT" -> null
      - multi_region                       = false -> null
      - policy                             = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::296255494825:root"
                        }
                      - Resource  = "*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = [
                          - "kms:GenerateDataKey*",
                          - "kms:Decrypt",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS     = "arn:aws:iam::806545929748:role/s3-scan-object"
                          - Service = "s3.amazonaws.com"
                        }
                      - Resource  = "*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region                             = "ca-central-1" -> null
      - rotation_period_in_days            = 365 -> null
      - tags                               = {
          - "CostCentre" = "notification-canada-ca-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all                           = {
          - "CostCentre" = "notification-canada-ca-production"
          - "Terraform"  = "true"
        } -> null
        # (2 unchanged attributes hidden)
    }
  # module.s3_scan_objects[0].aws_s3_bucket_notification.s3_scan_object will be destroyed
  # (because module.s3_scan_objects[0] is not in configuration)
  # (moved from module.s3_scan_objects[0].aws_s3_bucket_notification.s3_scan_object[0])
  - resource "aws_s3_bucket_notification" "s3_scan_object" {
      - bucket      = "notification-canada-ca-production-document-download-scan-files" -> null
      - eventbridge = false -> null
      - id          = "notification-canada-ca-production-document-download-scan-files" -> null
      - region      = "ca-central-1" -> null
      - queue {
          - events        = [
              - "s3:ObjectCreated:*",
            ] -> null
          - id            = "ScanObjectCreated" -> null
          - queue_arn     = "arn:aws:sqs:ca-central-1:296255494825:s3-scan-object" -> null
            # (2 unchanged attributes hidden)
        }
    }
  # module.s3_scan_objects[0].aws_s3_bucket_policy.upload_bucket[0] will be destroyed
  # (because module.s3_scan_objects[0] is not in configuration)
  - resource "aws_s3_bucket_policy" "upload_bucket" {
      - bucket = "notification-canada-ca-production-document-download-scan-files" -> null
      - id     = "notification-canada-ca-production-document-download-scan-files" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:PutObjectVersionTagging",
                          - "s3:PutObjectTagging",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::296255494825:role/ScanFilesGetObjects"
                        }
                      - Resource  = "arn:aws:s3:::notification-canada-ca-production-document-download-scan-files/*"
                    },
                  - {
                      - Action    = [
                          - "s3:ListBucket",
                          - "s3:GetObjectVersionTagging",
                          - "s3:GetObjectVersion",
                          - "s3:GetObjectTagging",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::296255494825:role/ScanFilesGetObjects"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::notification-canada-ca-production-document-download-scan-files/*",
                          - "arn:aws:s3:::notification-canada-ca-production-document-download-scan-files",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region = "ca-central-1" -> null
    }
  # module.s3_scan_objects[0].aws_sqs_queue.s3_scan_object will be destroyed
  # (because module.s3_scan_objects[0] is not in configuration)
  - resource "aws_sqs_queue" "s3_scan_object" {
      - arn                               = "arn:aws:sqs:ca-central-1:296255494825:s3-scan-object" -> null
      - content_based_deduplication       = false -> null
      - delay_seconds                     = 0 -> null
      - fifo_queue                        = false -> null
      - id                                = "https://sqs.ca-central-1.amazonaws.com/296255494825/s3-scan-object" -> null
      - kms_data_key_reuse_period_seconds = 300 -> null
      - kms_master_key_id                 = "arn:aws:kms:ca-central-1:296255494825:key/d456c5ca-c71d-4e66-b95c-75b78fb868b8" -> null
      - max_message_size                  = 262144 -> null
      - message_retention_seconds         = 345600 -> null
      - name                              = "s3-scan-object" -> null
      - policy                            = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sqs:SendMessage"
                      - Condition = {
                          - ArnEquals = {
                              - "aws:SourceArn" = "arn:aws:s3:::notification-canada-ca-production-document-download-scan-files"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "s3.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sqs:ca-central-1:296255494825:s3-scan-object"
                      - Sid       = "S3sendToSQS"
                    },
                  - {
                      - Action    = [
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::806545929748:role/s3-scan-object"
                        }
                      - Resource  = "arn:aws:sqs:ca-central-1:296255494825:s3-scan-object"
                      - Sid       = "LambdaTriggerFromSQS"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - receive_wait_time_seconds         = 0 -> null
      - region                            = "ca-central-1" -> null
      - sqs_managed_sse_enabled           = false -> null
      - tags                              = {
          - "CostCentre" = "notification-canada-ca-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all                          = {
          - "CostCentre" = "notification-canada-ca-production"
          - "Terraform"  = "true"
        } -> null
      - url                               = "https://sqs.ca-central-1.amazonaws.com/296255494825/s3-scan-object" -> null
      - visibility_timeout_seconds        = 300 -> null
        # (5 unchanged attributes hidden)
    }
  # module.s3_scan_objects[0].aws_sqs_queue_policy.s3_scan_object will be destroyed
  # (because module.s3_scan_objects[0] is not in configuration)
  - resource "aws_sqs_queue_policy" "s3_scan_object" {
      - id        = "https://sqs.ca-central-1.amazonaws.com/296255494825/s3-scan-object" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sqs:SendMessage"
                      - Condition = {
                          - ArnEquals = {
                              - "aws:SourceArn" = "arn:aws:s3:::notification-canada-ca-production-document-download-scan-files"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "s3.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sqs:ca-central-1:296255494825:s3-scan-object"
                      - Sid       = "S3sendToSQS"
                    },
                  - {
                      - Action    = [
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::806545929748:role/s3-scan-object"
                        }
                      - Resource  = "arn:aws:sqs:ca-central-1:296255494825:s3-scan-object"
                      - Sid       = "LambdaTriggerFromSQS"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - queue_url = "https://sqs.ca-central-1.amazonaws.com/296255494825/s3-scan-object" -> null
      - region    = "ca-central-1" -> null
    }
Plan: 9 to add, 2 to change, 17 to destroy.

# --- End of Plan 1 ---

```